{
  "films": [
    {
      "id": 1,
      "name": "Властелин колец: Братство кольца",
      "description": "Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу.Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил.",
      "released": 2001,
      "country": [
        "NewZealand",
        "USA"
      ],
      "genre": [
        "fantasy",
        "adventure",
        "drama",
        "action"
      ],
      "popularity": 78,
      "image": "https://kinohod.ru/o/4d/af/4dafcd7b-f41e-494c-b849-c918a6c72da8.jpg",
      "rating": 8.6,
      "duration": 178
    },
    {
      "id": 2,
      "name": "Властелин колец: Две крепости",
      "description": "Братство распалось, но Кольцо Всевластья должно быть уничтожено. Фродо и Сэм вынуждены довериться Голлуму, который взялся провести их к вратам Мордора. Громадная армия Сарумана приближается: члены братства и их союзники готовы принять бой. Битва за Средиземье продолжается.",
      "released": 2002,
      "country": [
        "NewZealand",
        "USA"
      ],
      "genre": [
        "fantasy",
        "adventure",
        "drama",
        "action"
      ],
      "popularity": 69,
      "image": "https://kinohod.ru/o/ae/a0/aea0ff90-f681-4372-9a18-dee72c9090e2.jpg",
      "rating": 8.6,
      "duration": 179
    },
    {
      "id": 3,
      "name": "Властелин колец: Возвращение короля",
      "description": "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.",
      "released": 2003,
      "genre": [
        "fantasy",
        "adventure",
        "drama",
        "action"
      ],
      "popularity": 75,
      "image": "https://kinohod.ru/o/3d/15/3d15b0fc-faca-464f-a0ee-9553cc81f456.jpg",
      "rating": 8.7,
      "duration": 201
    },
    {
      "id": 4,
      "name": "Гарри Поттер и философский камень",
      "description": "Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, едва ему исполнился год, а от дяди и тёти, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется. Странный гость, неожиданно появившийся на пороге, приносит письмо, из которого мальчик узнаёт, что на самом деле он - волшебник и зачислен в школу магии под названием Хогвартс. А уже через пару недель Гарри будет мчаться в поезде Хогвартс-экспресс навстречу новой жизни, где его ждут невероятные приключения, верные друзья и самое главное — ключ к разгадке тайны смерти его родителей.",
      "released": 2001,
      "genre": [
        "fantasy",
        "adventure",
        "family"
      ],
      "popularity": 72,
      "image": "https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQXKskA949YDC85-yvsGsHYgkXOh_og1Lt12vyGa5KthpCXnvti",
      "rating": 8.3,
      "duration": 152
    },
    {
      "id": 5,
      "name": "1+1",
      "description": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
      "released": 2011,
      "country": [
        "France"
      ],
      "genre": [
        "drama",
        "comedy",
        "biography"
      ],
      "popularity": 63,
      "image": "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/bf93b465-1189-4155-9dd1-cb9fb5cb1bb5/300x450",
      "rating": 8.8,
      "duration": 112
    },
    {
      "id": 6,
      "name": "Интерстеллар",
      "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "released": 2014,
      "country": [
        "USA",
        "United Kingdom",
        "Canada"
      ],
      "genre": [
        "fantastic",
        "drama",
        "adventure"
      ],
      "popularity": 57,
      "image": "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/430042eb-ee69-4818-aed0-a312400a26bf/300x450",
      "rating": 8.6,
      "duration": 169
    },
    {
      "id": 7,
      "name": "Джентльмены",
      "description": "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.",
      "released": 2019,
      "country": [
        "USA",
        "United Kingdom"
      ],
      "genre": [
        "crime",
        "comedy",
        "action"
      ],
      "popularity": 89,
      "image": "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/637271d5-61b4-4e46-ac83-6d07494c7645/300x450",
      "rating": 8.6,
      "duration": 113
    },
    {
      "id": 8,
      "name": "Чудо",
      "description": "С одной стороны мальчик Август Пулман такой же как и другие мальчишки его возраста - любит ходить на дни рождения к друзьям, играть в компьютерные игры, фанатеет от «Звездных войн», играет со своей собакой, ссорится и мирится со старшей сестрой. А с другой - он совсем не такой как другие мальчишки его возраста. Во-первых, Август никогда не ходил в обычную школу - с первого класса с ним дома занималась мама. Во-вторых, Август перенес 27 операций. Из-за очень редкой, но иногда встречающейся генетической ошибки у Августа нет лица. И вот такой мальчик должен пойти в школу. В первый раз. К обычным детям.",
      "released": 2017,
      "country": [
        "USA",
        "Hong Kong",
        "Canada"
      ],
      "genre": [
        "drama",
        "family"
      ],
      "popularity": 47,
      "image": "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/926f01c6-f373-415a-b6ca-42b027757d36/300x450",
      "rating": 8.1,
      "duration": 113
    }
  ]
}